/*
	РђР»РіРѕСЂРёС‚Рј СЂР°Р±РѕС‚С‹ РїСЂРѕРіСЂР°РјРјС‹:
	1) РЎРѕС…СЂР°РЅРµРЅС‹ РІСЃРµ РєРѕРѕСЂРґРёРЅР°С‚С‹ РіСЂР°РЅРёС†С‹ РљР°Р»РёРЅРёРЅРіСЂР°РґР°.
	2) Р’С‹С‡РёСЃР»СЏРµС‚СЃСЏ Р·Р°РґР°РЅРЅРѕРµ РєРѕР»-РІРѕ Р±Р»РёР¶Р°Р№С€РёС… С‚РѕС‡РµРє РіСЂР°РЅРёС†С‹ РѕС‚ РєР»РёРєР° РїРѕР»СЊР·РѕРІР°С‚РµР»СЏ.
	3) РР·РјРµСЂСЏРµС‚СЃСЏ СЂР°СЃСЃС‚РѕСЏРЅРёРµ Рё РІС‹Р±РёСЂР°РµС‚СЃСЏ РєСЂР°С‚С‡Р°Р№С€РµРµ.
*/

start();
// Р”Р»СЏ РёР·РѕР»СЏС†РёРё РѕР±Р»Р°СЃС‚Рё РІРёРґРёРјРѕСЃС‚Рё РїРµСЂРµРјРµРЅРЅС‹С…
function start(){
	// РЎРўР РћР“РР™ Р Р•Р–РРњ!
	'use strict';

	// РџРµСЂРµРјРµРЅРЅС‹Рµ

	// РњР°СЃСЃРёРІ РєРѕРѕСЂРґРёРЅР°С‚ РїСЂРёРіСЂР°РЅРёС‡РЅС‹С… С‚СЂР°СЃСЃ РЅР°С‡РёРЅР°СЏ СЃ СЃРµРІРµСЂР°
	var geoArr = [
		// РЎРµРІРµСЂ
		[54.770396, 20.502702],
		[54.767983, 20.551415],
		[54.758940, 20.563478],
		[54.750606, 20.566929],
		[54.747629, 20.565546],
		[54.744860, 20.564140],
		[54.741608, 20.556989],
		[54.739511, 20.556960],
		[54.738400, 20.557379],
		[54.736997, 20.557593],
		[54.736693, 20.560758],
		[54.735665, 20.561062],
		[54.734529, 20.562221],
		[54.733889, 20.563755],
		[54.731539, 20.569089],
		[54.727046, 20.579412],
		[54.731741, 20.589369],
		[54.724704, 20.597270],
		[54.719188, 20.596923],
		[54.713963, 20.596977],
		// Р’РѕСЃС‚РѕРє
		[54.705528, 20.601065],
		[54.706727, 20.618731],
		[54.701211, 20.598593],
		[54.671733, 20.629900],
		[54.667253, 20.617308],
		[54.658594, 20.607747],
		// Р®Рі
		[54.650247, 20.543729],
		[54.646344, 20.544746],
		[54.656660, 20.501521],
		[54.660265, 20.482037],
		[54.662373, 20.459330],
		[54.664230, 20.445642],
		[54.667097, 20.433216],
		[54.671016, 20.432565],
		[54.672916, 20.436004],
		[54.673834, 20.409686],
		[54.644396, 20.352153],
		[54.637401, 20.327948],
		// Р—Р°РїР°Рґ
		[54.707029, 20.315685],
		[54.731096, 20.322331],
		[54.736262, 20.298213],
		[54.749483, 20.296979],
		[54.756016, 20.369103],
		[54.775964, 20.418765]
	];

	//  РњР°СЃСЃРёРІ РєРѕРѕСЂРґРёРЅР°С‚ Р°РґРјРёРЅРёСЃС‚СЂР°С‚РёРІРЅРѕР№ РіСЂР°РЅРёС†С‹ РіРѕСЂРѕРґР°
	var cordon = [
		[54.767645, 20.541503],
		[54.768166, 20.551180],
		[54.767273, 20.556159],
		[54.766255, 20.559034],
		[54.764965, 20.560836],
		[54.763079, 20.562167],
		[54.752680, 20.566201],
		[54.751339, 20.567875],
		[54.750619, 20.566716],
		[54.750942, 20.563154],
		[54.748633, 20.562210],
		[54.747765, 20.565600],
		[54.744920, 20.564098],
		[54.745888, 20.559420],
		[54.744870, 20.558562],
		[54.740997, 20.556802],
		[54.740202, 20.556717],
		[54.737198, 20.557661],
		[54.735708, 20.560794],
		[54.734963, 20.561351],
		[54.734566, 20.562253],
		[54.733970, 20.562338],
		[54.733870, 20.564441],
		[54.733547, 20.564184],
		[54.732703, 20.565600],
		[54.732753, 20.566287],
		[54.731561, 20.568089],
		[54.731735, 20.568819],
		[54.727719, 20.578965],
		[54.727346, 20.578922],
		[54.726253, 20.581283],
		[54.726477, 20.581755],
		[54.725434, 20.584072],
		[54.731817, 20.589394],
		[54.731742, 20.594114],
		[54.731370, 20.594844],
		[54.731395, 20.592097],
		[54.731345, 20.592097],
		[54.725782, 20.587720],
		[54.724664, 20.597548],
		[54.717137, 20.596389],
		[54.717236, 20.594157],
		[54.715373, 20.593857],
		[54.715174, 20.596131],
		[54.707794, 20.597633],
		[54.707869, 20.598663],
		[54.704290, 20.603513],
		[54.704846, 20.607701],
		[54.705517, 20.608302],
		[54.706362, 20.610233],
		[54.708276, 20.612422],
		[54.709170, 20.614267],
		[54.708450, 20.615555],
		[54.708027, 20.617572],
		[54.707456, 20.618645],
		[54.706859, 20.618645],
		[54.701988, 20.598947],
		[54.701441, 20.598260],
		[54.682896, 20.599762],
		[54.683219, 20.603195],
		[54.682746, 20.606800],
		[54.683070, 20.607444],
		[54.682945, 20.613967],
		[54.684189, 20.626327],
		[54.683840, 20.627099],
		[54.685420, 20.645134],
		[54.682759, 20.650928],
		[54.680372, 20.653675],
		[54.678656, 20.652773],
		[54.677164, 20.642216],
		[54.678234, 20.631745],
		[54.677325, 20.631314],
		[54.673196, 20.631657],
		[54.672798, 20.631657],
		[54.672201, 20.632344],
		[54.672201, 20.630713],
		[54.671803, 20.630284],
		[54.673221, 20.626979],
		[54.672077, 20.625649],
		[54.671356, 20.622559],
		[54.670311, 20.622001],
		[54.667296, 20.617289],
		[54.666201, 20.615357],
		[54.663316, 20.614842],
		[54.659410, 20.613126],
		[54.658713, 20.611238],
		[54.658837, 20.608405],
		[54.658439, 20.607161],
		[54.668340, 20.582785],
		[54.667296, 20.580253],
		[54.661549, 20.582012],
		[54.660743, 20.579878],
		[54.659872, 20.576702],
		[54.654772, 20.588493],
		[54.652607, 20.585532],
		[54.653154, 20.583128],
		[54.657857, 20.573258],
		[54.657061, 20.572228],
		[54.654971, 20.570125],
		[54.654647, 20.570683],
		[54.654299, 20.567765],
		[54.655269, 20.565147],
		[54.656513, 20.558838],
		[54.655219, 20.556821],
		[54.653453, 20.557551],
		[54.652258, 20.557808],
		[54.653030, 20.556821],
		[54.654647, 20.553989],
		[54.655369, 20.551628],
		[54.654871, 20.551586],
		[54.655219, 20.549225],
		[54.653154, 20.545234],
		[54.652681, 20.543174],
		[54.645863, 20.544805],
		[54.645415, 20.538325],
		[54.650342, 20.536608],
		[54.650516, 20.538067],
		[54.653179, 20.537252],
		[54.655195, 20.535492],
		[54.654572, 20.531630],
		[54.655195, 20.513691],
		[54.657346, 20.494502],
		[54.659809, 20.484331],
		[54.661924, 20.473216],
		[54.662471, 20.461800],
		[54.662446, 20.450557],
		[54.666327, 20.441673],
		[54.666824, 20.439399],
		[54.666625, 20.436523],
		[54.667421, 20.432189],
		[54.670904, 20.432489],
		[54.672893, 20.435965],
		[54.673839, 20.431888],
		[54.684482, 20.419529],
		[54.684034, 20.414036],
		[54.682447, 20.410558],
		[54.675833, 20.413776],
		[54.673182, 20.406669],
		[54.671341, 20.399932],
		[54.665666, 20.391170],
		[54.658256, 20.394458],
		[54.655544, 20.385317],
		[54.653355, 20.386089],
		[54.645999, 20.361555],
		[54.644605, 20.350397],
		[54.630167, 20.304520],
		[54.692634, 20.294314],
		[54.692932, 20.303068],
		[54.697406, 20.316458],
		[54.725534, 20.321608],
		[54.732488, 20.318518],
		[54.734276, 20.327101],
		[54.736462, 20.331564],
		[54.736660, 20.307531],
		[54.734674, 20.307188],
		[54.735071, 20.303755],
		[54.736859, 20.305128],
		[54.735667, 20.297575],
		[54.750365, 20.295515],
		[54.748181, 20.301352],
		[54.750167, 20.303755],
		[54.736462, 20.341864],
		[54.746949, 20.358555],
		[54.756105, 20.375660],
		[54.755957, 20.368793],
		[54.759084, 20.370167],
		[54.758957, 20.370275],
		[54.760346, 20.365297],
		[54.760892, 20.365039],
		[54.760843, 20.362293],
		[54.762977, 20.357057],
		[54.769032, 20.356885],
		[54.769032, 20.363065],
		[54.772605, 20.365211],
		[54.774937, 20.363494],
		[54.776921, 20.363065],
		[54.776574, 20.366670],
		[54.776227, 20.381690],
		[54.778906, 20.393964],
		[54.776326, 20.418941],
		[54.772555, 20.423662],
		[54.775929, 20.433017],
		[54.777616, 20.432760],
		[54.777665, 20.479709],
		[54.767182, 20.494347],
		[54.771797, 20.507136],
		[54.771003, 20.515976],
		[54.765495, 20.521470],
		[54.765459, 20.528607],
		[54.764318, 20.532899],
		[54.766551, 20.535903],
		[54.763672, 20.535216],
		[54.763176, 20.540366],
		[54.767792, 20.541396]
	];

	// Р—Р°РґР°С‚СЊ РІС‹РїРѕР»РЅРµРЅРёРµ РїРѕСЃР»Рµ Р·Р°РіСЂСѓР·РєРё РєР°СЂС‚
    ymaps.ready(function init(){
		// РЎРѕР·РґР°РЅРёРµ СЌРєР·РµРјРїР»СЏСЂР° РєР»Р°СЃСЃР° РєР°СЂС‚С‹
		var myMap = new ymaps.Map("map", {
            center: [54.713720, 20.517130],
            zoom: 10,
			controls: ['zoomControl', 'fullscreenControl', 'geolocationControl']
        }, {
			suppressMapOpenBlock: true,
			yandexMapDisablePoiInteractivity: true
		});
		var searchControl = new ymaps.control.SearchControl({
			 options: {
				 noPlacemark: true
			 }
		});
		myMap.controls.add(searchControl);

		// РЎРѕР·РґР°РЅРёРµ РјРЅРѕРіРѕСѓРіРѕР»СЊРЅРёРєР° РѕС…РІР°С‚Р° С‚РѕС‡РєР°РјРё
		var myPolyline = new ymaps.GeoObject({
			geometry: {
				type: "LineString",
				coordinates: cordon
			},
			properties: {
				hintContent: 'РљР°Р»РёРЅРёРЅРіСЂР°Рґ'
			}
		},{
			visible: true,
			strokeWidth: 3,
			strokeColor: '#00B8D9'
		});
		myMap.geoObjects.add(myPolyline);

		// РњРЅРѕРіРѕСѓРіРѕР»СЊРЅРёРє РѕС…РІР°С‚Р° С‚РѕС‡РєР°РјРё
		var myPolygon = new ymaps.GeoObject({
			geometry: {
				type: "Polygon",
				coordinates: [cordon]
			}
		},{
			visible: false
		});
		myMap.geoObjects.add(myPolygon);

		// РЎРѕР·РґР°РЅРёРµ С‚РѕС‡РµС‡РЅС‹С… РіРµРѕР±СЉРµРєС‚РѕРІ
		var geoObjArr = []; // РњР°СЃСЃРёРІ РіРµРѕРѕР±СЉРµРєС‚РѕРІ
		for(var i = 0; i < geoArr.length; i++){
			// Р—Р°РїРѕР»РЅРµРЅРёРµ РјР°СЃСЃРёРІР° РіРµРѕРѕР±СЉРµРєС‚Р°РјРё
			geoObjArr.push(
				new ymaps.GeoObject({
					geometry: {
						type: 'Point',
						coordinates: geoArr[i]
					}
				},{
					visible: false
				})
			);
			// Р”РѕР±Р°РІР»РµРЅРёРµ РіРµРѕРѕР±СЉРµРєС‚РѕРІ РЅР° РєР°СЂС‚Сѓ
			myMap.geoObjects.add(geoObjArr[i]);
			// РћС‚Р»Р°РґРєР°. Р”РѕР±Р°РІР»РµРЅРёРµ СЃРѕР±С‹С‚РёСЏ РєР»РёРєР° РЅР° СЌР»РµРјРµРЅС‚ РґР»СЏ РїРѕР»СѓС‡РµРЅРёСЏ РµРіРѕ РєРѕРѕСЂРґРёРЅР°С‚
			//geoObjArr[i].events.add('click', function(e){
				//alert(e.get('coords'));
			//});
		}

		// РћР±СЂР°Р±РѕС‚РєР° СЃРѕР±С‹С‚РёСЏ СЂРµР·СѓР»СЊС‚Р°С‚Р° РїРѕРєР°Р·Р° РїРѕРёСЃРєР°
		searchControl.events.add('resultshow', function(e){
			// РџСЂРѕРІРµСЂСЏРµРј, С‡С‚Рѕ СЌС‚Рѕ СЃРѕР±С‹С‚РёРµ РЅРµ "РґРѕР·Р°РіСЂСѓР·РєРё" СЂРµР·СѓР»СЊС‚Р°С‚РѕРІ Рё
			// РїРѕ Р·Р°РїСЂРѕСЃСѓ РЅР°Р№РґРµРЅ С…РѕС‚СЏ Р±С‹ РѕРґРёРЅ СЂРµР·СѓР»СЊС‚Р°С‚.
			if (!e.get('skip') && e.get('target').getResultsCount()){
				// РџРµСЂРµРґР°С‡Р° РєРѕРѕСЂРґРёРЅР°С‚РѕРІ РєР»РёРєР° РІ С„СѓРЅРєС†РёСЋ
				proc(e.get('target').state._data.results[0].geometry.getCoordinates());
			}
		});
		
		// РћР±СЂР°Р±РѕС‚РєР° СЃРѕР±С‹С‚РёСЏ Р°РІС‚РѕРѕРїСЂРµРґРµР»РµРЅРёСЏ РјРµСЃС‚РѕРїРѕР»РѕР¶РµРЅРёСЏ
		myMap.controls.get('geolocationControl').events.add('locationchange', function(e){
			// РџРµСЂРµРґР°С‡Р° РєРѕРѕСЂРґРёРЅР°С‚РѕРІ РєР»РёРєР° РІ С„СѓРЅРєС†РёСЋ
			proc(e.get('geoObjects').get(0).geometry.getCoordinates());
		});
		
		myMap.events.add('boundschange', function(e){
			if(e.get('newZoom') >= 11){
				myMap.geoObjects.remove(myPolyline);
			}else{
				myMap.geoObjects.add(myPolyline);
			}
		});

		// РћР±СЂР°Р±РѕС‚РєР° СЃРѕР±С‹С‚РёСЏ РєР»РёРєР° РЅР° РєР°СЂС‚Сѓ
		myMap.events.add('click', function(e){
			// РџРµСЂРµРґР°С‡Р° РєРѕРѕСЂРґРёРЅР°С‚РѕРІ РєР»РёРєР° РІ С„СѓРЅРєС†РёСЋ
			proc(e.get('coords'));
		});

		// Р—Р°РіСЂСѓР·РєР° РІС‹Р±РѕСЂРєРё
		var result = ymaps.geoQuery(geoObjArr);
		// РџРѕР»СѓС‡РµРЅРёРµ РіСЂР°РЅРёС†С‹ РѕС…РІР°С‚Р°
		var bounds = result.getBounds();
		// РҐСЂР°РЅРёС‚ РїРѕСЃР»РµРґРЅРёР№ РјР°СЂС€СЂСѓС‚ С‡С‚РѕР±С‹ РµРіРѕ РјРѕР¶РЅРѕ Р±С‹Р»Рѕ СѓРґР°Р»РёС‚СЊ 
		var lastRoute = null;
		// Р—Р°РїСЂРµС‰Р°РµС‚ СЃС‚СЂРѕРёС‚СЊ РґРІР° РјР°СЂС€СЂСѓС‚Р° РѕРґРЅРѕРІСЂРµРјРµРЅРЅРѕ
		var inProcess = false;
		// РњРµС‚РєР°
		var placemark;
		var content = '';

		// Р¦РµРЅС‚СЂРёСЂСѓРµС‚, Р·СѓРјРёСЂСѓРµС‚, СЂР°СЃСЃС‡РёС‚С‹РІР°РµС‚ СЃС‚РѕРёРјРѕСЃС‚СЊ РґРѕСЃС‚Р°РІРєРё
		// РџСЂРёРЅРёРјР°РµС‚: (array) РєРѕРѕСЂРґРёРЅР°С‚С‹ РґРѕСЃС‚Р°РІРєРё
		// Р’РѕР·РІР°С‰Р°РµС‚: (void)
		function proc(clickCoords){
			// РћРєСЂСѓРіР»СЏРµС‚ С‡РёСЃР»Р°
			// РџСЂРёРЅРёРјР°РµС‚: (int) С‡РёСЃР»Рѕ, (int) С‚РѕС‡РЅРѕСЃС‚СЊ РѕРєСЂСѓРіР»РµРЅРёСЏ
			// Р’РѕР·РІСЂР°С‰Р°РµС‚: (int) СЂРµР·СѓР»СЊС‚Р°С‚
			function roundOff(number, scale){
				return Math.ceil(number / scale) * scale;
			}
			
			function getCityNameInObject(obj){
				var search = false;
				for (var i = 0; i < obj.length; i++) {
					if(obj[i].kind == 'locality'){
						search = obj[i].name;
						break;
					}
				}
				return search;
			}

			// РќР° РѕСЃРЅРѕРІРµ РіРµРѕРєРѕРґРёСЂРѕРІР°РЅРёСЏ, РІС‹С‡РёСЃР»СЏРµС‚ РІРѕР·РјРѕР¶РЅРѕСЃС‚СЊ РґРѕСЃС‚Р°РІРєРё, Р°РґСЂРµСЃ, С†РµРЅСѓ
			// РџСЂРёРЅРёРјР°РµС‚: (array) РєРѕРѕСЂРґРёРЅР°С‚С‹ РєР»РёРєР°
			// Р’РѕР·РІСЂР°С‰Р°РµС‚: (void)
			function geocode(){
				ymaps.geocode(clickCoords).then(function(res){
					if(typeof res.geoObjects.get(0) != 'undefined'){
						var countryCode = res.geoObjects.get(0).getCountryCode(),
							placeName = res.geoObjects.get(0).getAdministrativeAreas()[0],
							address = res.geoObjects.get(0).properties.get('text'),
							addressLine = res.geoObjects.get(0).getAddressLine(),
							city = getCityNameInObject(res.geoObjects.get(0).properties.get('metaDataProperty').GeocoderMetaData.Address.Components),
							price = '',
							date = '';
						// РџСЂРѕРІРµСЂРєР° СЃС‚СЂР°РЅС‹
						if (countryCode == 'RU'){
							// РџСЂРѕРІРµСЂРєР° РѕР±Р»Р°СЃС‚СЊ РёР»Рё СЃС‚СЂР°РЅР°
							if (placeName != 'РљР°Р»РёРЅРёРЅРіСЂР°РґСЃРєР°СЏ РѕР±Р»Р°СЃС‚СЊ'){
								price = '200 СЂ. + СЃС‚РѕРёРјРѕСЃС‚СЊ РѕС‚РїСЂР°РІРєРё РїРѕ СЃС‚Р°РЅРґР°СЂС‚РЅРѕРјСѓ С‚Р°СЂРёС„Сѓ С‚СЂР°РЅСЃРїРѕСЂС‚РЅРѕР№ РєРѕРјРїР°РЅРёРё';
								date = '<b>РЎСЂРѕРєРё РѕС‚РїСЂР°РІРєРё:</b><br> Р”Рѕ 1 СЂР°Р±РѕС‡РµРіРѕ РґРЅСЏ';
							}else{ // РРЅР°С‡Рµ РљР°Р»РёРЅРёРЅРіСЂР°РґСЃРєР°СЏ РѕР±Р»Р°СЃС‚Рё
								// Р•СЃР»Рё РєРѕРѕСЂРґРёРЅР°С‚С‹ С‚РµСЂСЂРёС‚РѕСЂРёРё РіРѕСЂРѕРґР°
								//console.log(addressLine.substr(0,12));
								if (city == 'РљР°Р»РёРЅРёРЅРіСЂР°Рґ'){//Р—РґРµСЃСЊ Р±С‹Р» РёРЅРґСѓСЃ
									date = '<b>РЎСЂРѕРєРё РґРѕСЃС‚Р°РІРєРё:</b><br> Р”Рѕ 1 СЂР°Р±РѕС‡РµРіРѕ РґРЅСЏ';
									price = '200 СЂ./ Р±РµСЃРїР»Р°С‚РЅРѕ РїСЂРё Р·Р°РєР°Р·Рµ РѕС‚ 10 000 СЂ.';
								}else if(placeName == 'РљР°Р»РёРЅРёРЅРіСЂР°РґСЃРєР°СЏ РѕР±Р»Р°СЃС‚СЊ'){ // РРЅР°С‡Рµ РєРѕРѕСЂРґРёРЅР°С‚С‹ РѕР±Р»Р°СЃС‚Рё
									// Р—Р°РїСѓСЃРє РїРѕРёСЃРєР° РѕРїС‚РёРјР°Р»СЊРЅРѕРіРѕ РјР°СЂС€СЂСѓС‚Р°
									date = '<b>РЎСЂРѕРєРё РґРѕСЃС‚Р°РІРєРё:</b><br> Р”Рѕ 2 СЂР°Р±РѕС‡РёС… РґРЅРµР№';
									searchOptimalRoute(address, date);
									return; // Р’С‹С…РѕРґ РёР· С‚РµРєСѓС‰РµР№ С„СѓРЅРєС†РёРё
								}
							}
						}else{//Р—РґРµСЃСЊ Р±С‹Р» РёРЅРґСѓСЃ
							balloon('РћС€РёР±РєР°', 'РћС€РёР±РєР°', 'РћС€РёР±РєР°', true);
							inProcess = false;
							return;
						}
						// РћРєРѕС€РєРѕ СЂРµР·СѓР»СЊС‚Р°С‚Р°
						balloon(address, price, date);
						inProcess = false; // РџСЂРѕС†РµСЃСЃ РѕРєРѕРЅС‡РёР»СЃСЏ
					}else{
						balloon('РћС€РёР±РєР°', 'РћС€РёР±РєР°', 'РћС€РёР±РєР°', true);
						inProcess = false;
					}
				}, function(err){
					// РћР±СЂР°Р±РѕС‚РєР° РѕС€РёР±РєРё
					console.log(err);
					// РћРєРѕС€РєРѕ СЂРµР·СѓР»СЊС‚Р°С‚Р°
					balloon('РћС€РёР±РєР°', 'РћС€РёР±РєР°', 'РћС€РёР±РєР°');
					inProcess = false; // РџСЂРѕС†РµСЃСЃ РѕРєРѕРЅС‡РёР»СЃСЏ
				});
			}

			// РќР° РѕСЃРЅРѕРІРµ РјР°СЂС€СЂСѓС‚РёР·Р°С†РёРё РІС‹С‡РёСЃР»СЏРµС‚ СЃС‚РѕРёРјРѕСЃС‚СЊ
			// РџСЂРёРЅРёРјР°РµС‚: (void)
			// Р’РѕР·РІСЂР°С‰Р°РµС‚: (void)
			function searchOptimalRoute(address, date){
				ymaps.route([[54.71180640698032, 20.508499275127537], clickCoords]).then(function(route){
					// РџРµСЂРµРІРѕРґ СЂР°СЃСЃС‚РѕСЏРЅРёСЏ РІ РєРёР»РѕРјРµС‚СЂС‹
					var km = route.getLength() / 1000;
					// Р’С‹С‡РёСЃР»РµРЅРёРµ СЃС‚РѕРёРјРѕСЃС‚Рё
					var price = roundOff(200 + km * 10, 50) + ' СЂСѓР±';
					balloon(address, price, date);
					inProcess = false; // РџСЂРѕС†РµСЃСЃ РѕРєРѕРЅС‡РёР»СЃСЏ
				}, function(err){
					// РћР±СЂР°Р±РѕС‚РєР° РѕС€РёР±РєРё
					console.log(err);
					// РћРєРѕС€РєРѕ СЂРµР·СѓР»СЊС‚Р°С‚Р°
					balloon(address, 'РћС€РёР±РєР°', date);
					inProcess = false; // РџСЂРѕС†РµСЃСЃ РѕРєРѕРЅС‡РёР»СЃСЏ
				});
			}

			// balloon Рё С†РµРЅС‚СЂРёСЂРѕРІР°РЅРёРµ
			// РџСЂРёРЅРёРјР°РµС‚: (string) Р°РґСЂРµСЃ, (string) С†РµРЅР°, (string) РґР°С‚Р° РґРѕСЃС‚Р°РІРєРё
			// Р’РѕР·РІСЂР°С‰Р°РµС‚: (void)
			function balloon(address, price, date, country = false){
				if(!country){
					content = 	'<b>РљРѕРѕСЂРґРёРЅР°С‚С‹:</b><br>' + clickCoords[0].toFixed(3) + ', ' + clickCoords[1].toFixed(3) + '<br>' + 
								'<b>РђРґСЂРµСЃ:</b><br>' + address + '<br>' + 
								'<b>РЎС‚РѕРёРјРѕСЃС‚СЊ:</b><br>' + price + '<br>' + 
								date
				}else{
					content = 	'<b>Р”РѕСЃС‚Р°РІРєР° РѕСЃСѓС‰РµСЃС‚РІР»СЏРµС‚СЃСЏ С‚РѕР»СЊРєРѕ РїРѕ Р РѕСЃСЃРёРё</b>'
				}
				myMap.balloon.open(clickCoords, {
					contentHeader	: 'Р Р°СЃС‡С‘С‚ СЃС‚РѕРёРјРѕСЃС‚Рё РґРѕСЃС‚Р°РІРєРё',
					contentBody		: content
				});
				if (placemark) {
					placemark.geometry.setCoordinates(clickCoords);
				}else{
					placemark = new ymaps.Placemark(clickCoords, {}, {preset: "islands#redDotIcon"});
					placemark.events.add('click', function(e){
						myMap.balloon.open(placemark.geometry.getCoordinates(), {
							contentHeader	: 'Р Р°СЃС‡С‘С‚ СЃС‚РѕРёРјРѕСЃС‚Рё РґРѕСЃС‚Р°РІРєРё',
							contentBody		: content
						})
					})
					myMap.geoObjects.add(placemark);
				}
				myMap.setCenter(clickCoords); // Р¦РµРЅС‚СЂРёСЂРѕРІР°РЅРёРµ
				if(myMap.getZoom() < 16){// Р—СѓРјРёСЂРѕРІР°РЅРёРµ
					myMap.setZoom(16)
				}
			}

			// РљРѕРґ С‚РµРєСѓС‰РµР№ С„СѓРЅРєС†РёРё
			if (inProcess){//Р—РґРµСЃСЊ Р±С‹Р» РёРЅРґСѓСЃ
				return; // Р•СЃР»Рё СѓР¶Рµ РІ РїСЂРѕС†РµСЃСЃРµ, С‚Рѕ РІС‹С…РѕРґРёРј
			}
			inProcess = true;

			balloon('РРґС‘С‚ СЂР°СЃС‡С‘С‚...', 'РРґС‘С‚ СЂР°СЃС‡С‘С‚...', 'РРґС‘С‚ СЂР°СЃС‡С‘С‚...');

			// РЎРѕСЂС‚РёСЂРѕРІРєР° РІС‹Р±РѕСЂРєРё РїРѕ РґРёСЃС‚Р°РЅС†РёРё
			result = result.sortByDistance(clickCoords);

			// РЈРґР°Р»РµРЅРёРµ РёР· РєР°СЂС‚С‹ РїСЂРµРґС‹РґСѓС‰РµРіРѕ РјР°СЂС€СЂСѓС‚Р°
			//if (lastRoute != null) myMap.geoObjects.remove(lastRoute);

			// Р—Р°РїСѓСЃРє Р°Р»РіРѕСЂРёС‚РјР°
			geocode();
		} // РљРѕРЅРµС† proc()
	}); // РљРѕРЅРµС† init()
} // РљРѕРЅРµС† start()